# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

my_list=[5,-5,6,8,10]
total=0
for el in my_list:
    total=total+el
print (total)
