# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр

s = ""
for i, el in enumerate(names, 1):
    s = s + el
    if i != len(names):
        s = s + ", "
print(s)
